Revit 2026 API

# StructuralAssetWoodBendingStrength Property

---

The bending strength of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double WoodBendingStrength { get; set; }
```
```vb
Public Property WoodBendingStrength As Double
	Get
	Set
```
```cpp
public:
property double WoodBendingStrength {
	double get ();
	void set (double value);
}
```
```fsharp
member WoodBendingStrength : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be wood to set this property. |

Applies to wood-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace